InformationRegisters/НастройкаАктуальности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкаАктуальности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.УсловияНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.МодификаторыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаАктуальности/Forms/ФормаВосстановленияНастроек/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец 	= ЭтаФорма.Параметры.Владелец;
	ИмяОбъекта 	= ЭтаФорма.Параметры.ИмяОбъекта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТаблицуНастроекНаСервере(ИмяОбъекта, Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаНастроек.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Настройка = ТекущиеДанные.НаименованиеНастройки;
	
	ВосстановитьНаСервере(Отказ, ИмяОбъекта, Настройка);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Отказ = Ложь;
	
	ТекущиеДанные 	= Элементы.ТаблицаНастроек.ТекущиеДанные;
	Настройка 		= ТекущиеДанные.НаименованиеНастройки;
	
	ВосстановитьНаСервере(Отказ, ИмяОбъекта, Настройка);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастроекНаСервере(ИмяОбъекта, Владелец)
	
	Настройки = РегистрыСведений.НастройкаАктуальности.СформироватьТаблицуНастроек(ИмяОбъекта, Владелец);
	
	ЗначениеВРеквизитФормы(Настройки, "ТаблицаНастроек");
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНаСервере(Отказ, ИмяОбъекта, Настройка)
	
	РегистрыСведений.НастройкаАктуальности.ВосстановитьНастройку(Отказ, ИмяОбъекта, Настройка, Владелец);
	
КонецПроцедуры
